In [316]:
import pandas as pd 
import numpy as np 
from sqlalchemy import create_engine
import sqlalchemy

In [320]:
import pymysql

host = 'easymoney-db.ct1jtd8962g9.us-east-2.rds.amazonaws.com'
user = 'admin'
password = 'carlos1234'
database = 'easymoney-db'

db = pymysql.connect(host = host, user = user, password = password)
cursor = db.cursor()

cursor.connection.commit()

sSQL = ''' USE easymoney'''
cursor.execute(sSQL)

0

In [258]:
cursor.execute("select version()")

1

In [259]:
data = cursor.fetchone()
print(data)

('8.0.20',)

In [257]:
sSQL = ''' CREATE DATABASE easymoney '''
cursor.execute(sSQL)

ProgrammingError: (1007, "Can't create database 'easymoney'; database exists")

In [43]:
sSQL = ''' CREATE TABLE person (
    id INT,
    fname TEXT,
    lname TEXT,
    PRIMARY KEY (id)
) '''
cursor.execute(sSQL)

0

In [318]:
sSQL = ''' SHOW TABLES '''
cursor.execute(sSQL)
cursor.fetchall()

(('altas',),
 ('antiguedades',),
 ('clientes_primerizos',),
 ('mapa_clientes',),
 ('permanencias',),
 ('person',))

In [96]:
import pandas as pd
import numpy as np

dir_path = '/Users/carlosperezricardo/Documents/data/'

In [307]:
variables = {'pk_cid':'INT','pk_partition':'VARCHAR(11)', 'short_term_deposit':'INT', 'loans':'INT', 
    'mortgage':'INT', 'funds':'INT','securities':'INT', 'long_term_deposit':'INT', 'em_account_pp':'INT', 
    'credit_card':'INT','payroll_account':'INT', 'emc_account':'INT', 'debit_card':'INT', 
    'em_account_p':'INT','em_acount':'INT',
    'producto_1':'VARCHAR(30)', 'producto_2':'VARCHAR(30)', 'total':'INT', 'total_1':'INT', 'total_2':'INT', 'prop_1':'FLOAT',
    'pais':'VARCHAR(30)', 'region':'VARCHAR(30)', 'lat':'FLOAT', 'lon':'FLOAT', 'count':'INT',
    'entry_date':'VARCHAR(11)', 'entry_channel':'VARCHAR(6)', 'active_customer':'TINYINT', 'segment':'VARCHAR(20)',
    'buy':'TINYINT','total_ingresos':'INT', 'total_products':'INT', 'payroll':'INT', 'pension_plan':'INT'}

# combinations: 'producto_1', 'producto_2', 'total', 'total_1', 'total_2', 'prop_1'  
# mapa: 'pais', 'region', 'lat', 'long', 'count'
# clientes_primerizos = 'pk_cid', 'pk_partition', 'entry_date', 'entry_channel',
#       'active_customer', 'segment', 'short_term_deposit', 'loans', 'mortgage',
#       'funds', 'securities', 'long_term_deposit', 'em_account_pp',
#       'credit_card', 'payroll', 'pension_plan', 'payroll_account',
#       'emc_account', 'debit_card', 'em_account_p', 'em_acount', 'buy',
#       'total_ingresos', 'total_products']

In [260]:
def create_table(cursor, df, variables, table_name):
    sSQL = "CREATE TABLE " + table_name + " ( "
        
    for col, i in zip(df.columns, range(len(df.columns))):
        if i == len(df.columns)-1:
            sSQL = sSQL + col + ' ' +  variables[col] + ' )'
        else:
            sSQL = sSQL + col + ' ' + variables[col] + ', '
    print(sSQL)
    cursor.execute(sSQL)

In [282]:
def insert_into_db (cursor, df, variables, table_name):
    for key, row in df.iterrows():
        sSQL = " INSERT INTO "+table_name+"  VALUES ( "
        for col, i in zip(df.columns, range(len(df.columns))):
            if str(variables[col])[:7] == 'VARCHAR':
                if i == len(df.columns)-1:
                    sSQL = sSQL + ' " ' + row[col] + ' " ' + ' )'
                else:
                    sSQL = sSQL + '"' + str(row[col]) + '"' + ', '
            else:
                if i == len(df.columns)-1:
                    sSQL = sSQL + str(row[col]) + ' )'
                else:
                    sSQL = sSQL + str(row[col]) + ', '
        cursor.execute(sSQL)
    print('Acabado!')
    #break

## ALTAS

In [204]:
altas_df = pd.read_csv(dir_path+'altas.csv')
altas_df.columns

Index(['pk_partition', 'short_term_deposit', 'loans', 'mortgage', 'funds',
       'securities', 'long_term_deposit', 'em_account_pp', 'credit_card',
       'payroll_account', 'emc_account', 'debit_card', 'em_account_p',
       'em_acount'],
      dtype='object')

In [229]:
try:
    sSQL = "DROP TABLE altas"
    cursor.execute(sSQL)
except: 
    pass

0

In [230]:
create_table(cursor, altas_df, variables, "altas")

CREATE TABLE altas ( pk_partition VARCHAR(11), short_term_deposit INT, loans INT, mortgage INT, funds INT, securities INT, long_term_deposit INT, em_account_pp INT, credit_card INT, payroll_account INT, emc_account INT, debit_card INT, em_account_p INT, em_acount INT )

In [207]:
sSQL = ''' SHOW TABLES '''
cursor.execute(sSQL)
cursor.fetchall()

(('altas',), ('bajas',), ('person',), ('productos_existentes',))

In [208]:
insert_into_db (cursor, altas_df, variables, "altas")
db.commit()

Acabado!

In [209]:
list_altas_df = list(altas_df.columns)

In [210]:
list_df = ['pk_partition','short_term_deposit','loans','mortgage','funds','securities',
 'long_term_deposit','em_account_pp','credit_card','payroll_account','emc_account','debit_card','em_account_p','em_acount']

sSQL = "SELECT * FROM altas"
cursor.execute(sSQL)
altas_df = pd.DataFrame(cursor.fetchall(), columns=list_df)
altas_df

,pk_partition,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll_account,emc_account,debit_card,em_account_p,em_acount
0,2018-01-28,883,19,15,786,932,4884,0,3325,13478,15320,24696,2,215293
1,2018-02-28,665,0,0,97,68,225,0,510,974,807,3708,0,4156
2,2018-03-28,652,4,2,119,47,261,0,735,1015,915,4062,0,4021
3,2018-04-28,419,3,1,127,45,249,0,652,1098,840,3507,0,3608
4,2018-05-28,383,3,1,83,47,355,0,630,1126,865,3193,0,3761
5,2018-06-28,443,0,1,53,42,387,0,752,1119,685,3700,0,5566
6,2018-07-28,451,1,1,54,59,450,0,776,1652,552,3973,0,13301
7,2018-08-28,434,2,0,63,101,345,0,694,1556,448,3659,0,14888
8,2018-09-28,498,2,0,38,77,497,0,749,1075,586,5288,0,18404
9,2018-10-28,412,2,0,40,179,506,0,743,1398,569,6319,0,19963
10,2018-11-28,96,0,0,52,39,366,0,713,1861,943,5258,0,11358
11,2018-12-28,6,1,0,60,86,464,0,664,2294,901,5154,0,8060
12,2019-01-28,0,1,1,36,254,194,0,653,1365,1178,4694,0,6288
13,2019-02-28,0,1,0,25,120,219,0,708,1379,1235,6138,0,4997
14,2019-03-28,0,3,0,28,65,76,0,741,1516,1033,5580,0,5539
15,2019-04-28,0,2,3,26,44,27,0,713,1475,1283,5005,0,4231
16,2019-05-28,0,0,0,18,39,12,0,761,1531,1607,5140,0,4036

## BAJAS

In [211]:
bajas_df = pd.read_csv(dir_path+'bajas.csv')
bajas_df.columns

Index(['pk_partition', 'short_term_deposit', 'loans', 'mortgage', 'funds',
       'securities', 'long_term_deposit', 'em_account_pp', 'credit_card',
       'payroll_account', 'emc_account', 'debit_card', 'em_account_p',
       'em_acount'],
      dtype='object')

In [262]:
try:
    sSQL = "DROP TABLE bajas"
    cursor.execute(sSQL)
except: 
    pass

In [213]:
create_table(cursor, bajas_df, variables, "bajas")

CREATE TABLE bajas ( pk_partition VARCHAR(11), short_term_deposit INT, loans INT, mortgage INT, funds INT, securities INT, long_term_deposit INT, em_account_pp INT, credit_card INT, payroll_account INT, emc_account INT, debit_card INT, em_account_p INT, em_acount INT )

In [214]:
insert_into_db (cursor, bajas_df, variables, "bajas")
db.commit()

Acabado!

In [215]:
list_df = ['pk_partition','short_term_deposit','loans','mortgage','funds','securities',
 'long_term_deposit','em_account_pp','credit_card','payroll_account','emc_account','debit_card','em_account_p','em_acount']

sSQL = "SELECT * FROM bajas"
cursor.execute(sSQL)
bajas_df = pd.DataFrame(cursor.fetchall(), columns=list_df)
bajas_df

,pk_partition,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll_account,emc_account,debit_card,em_account_p,em_acount
0,2018-01-28,0,0,0,0,0,0,0,0,0,0,0,0,0
1,2018-02-28,205,0,0,11,35,153,0,553,206,300,2913,0,2351
2,2018-03-28,331,0,0,22,47,252,0,506,272,314,2429,0,2436
3,2018-04-28,343,2,1,12,27,107,0,410,261,321,2735,0,2433
4,2018-05-28,668,0,0,22,18,106,0,558,254,243,3010,0,2286
5,2018-06-28,654,0,0,39,35,155,0,516,2271,293,2751,0,2465
6,2018-07-28,413,0,0,41,25,242,0,641,276,317,3223,0,3305
7,2018-08-28,381,1,0,16,21,218,0,625,354,300,4010,0,3222
8,2018-09-28,446,0,0,20,9,262,0,666,331,301,2792,0,3158
9,2018-10-28,424,0,1,28,32,284,0,647,315,342,3588,0,3454
10,2018-11-28,452,1,0,19,27,299,0,585,368,293,4140,0,4137
11,2018-12-28,496,3,0,20,26,162,0,640,2372,352,3168,0,4019
12,2019-01-28,403,3,0,28,19,284,0,696,400,298,4744,0,3418
13,2019-02-28,114,0,0,39,28,220,0,659,439,356,4064,0,3768
14,2019-03-28,9,3,0,22,43,197,0,707,390,347,3556,0,3472
15,2019-04-28,0,1,0,27,31,196,0,542,363,307,4227,0,3423
16,2019-05-28,0,0,0,23,32,251,0,707,501,305,4000,0,3484

## PRODUCTOS EXISTENTES

In [216]:
products_exist_df = pd.read_csv(dir_path+'products_exist.csv')
products_exist_df.columns

Index(['pk_partition', 'short_term_deposit', 'loans', 'mortgage', 'funds',
       'securities', 'long_term_deposit', 'em_account_pp', 'credit_card',
       'payroll_account', 'emc_account', 'debit_card', 'em_account_p',
       'em_acount'],
      dtype='object')

In [263]:
try:
    sSQL = "DROP TABLE productos_existentes"
    cursor.execute(sSQL)
except: 
    pass

In [218]:
create_table(cursor, products_exist_df, variables, "productos_existentes")

CREATE TABLE productos_existentes ( pk_partition VARCHAR(11), short_term_deposit INT, loans INT, mortgage INT, funds INT, securities INT, long_term_deposit INT, em_account_pp INT, credit_card INT, payroll_account INT, emc_account INT, debit_card INT, em_account_p INT, em_acount INT )

In [219]:
insert_into_db (cursor, products_exist_df, variables, "productos_existentes")
db.commit()

Acabado!

In [220]:
list_df = ['pk_partition','short_term_deposit','loans','mortgage','funds','securities',
 'long_term_deposit','em_account_pp','credit_card','payroll_account','emc_account','debit_card','em_account_p','em_acount']

sSQL = "SELECT * FROM productos_existentes"
cursor.execute(sSQL)
products_exist_df = pd.DataFrame(cursor.fetchall(), columns=list_df)
products_exist_df

,pk_partition,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll_account,emc_account,debit_card,em_account_p,em_acount
0,2018-01-28,883,19,15,786,932,4884,0,3325,13478,15320,24696,2,215293
1,2018-02-28,1343,19,15,872,965,4956,0,3282,14246,15827,25448,2,217098
2,2018-03-28,1664,23,17,969,965,4965,0,3511,14989,16428,27046,2,218683
3,2018-04-28,1740,24,17,1084,983,5107,0,3725,15825,16947,27764,2,219816
4,2018-05-28,1455,27,18,1145,1012,5356,0,3797,16697,17569,27911,2,221291
5,2018-06-28,1244,27,19,1159,1019,5588,0,4002,15540,17950,28828,2,224328
6,2018-07-28,1282,28,20,1172,1053,5796,0,4137,16916,18185,29578,2,234324
7,2018-08-28,1335,29,20,1219,1133,5923,0,4206,18118,18333,29205,2,245980
8,2018-09-28,1386,31,20,1237,1201,6158,0,4289,18862,18618,31684,2,261210
9,2018-10-28,1374,33,19,1249,1348,6380,0,4385,19945,18844,34372,2,277707
10,2018-11-28,1018,32,19,1282,1360,6447,0,4512,21437,19494,35466,2,284900
11,2018-12-28,528,30,19,1322,1420,6749,0,4536,21359,20043,37430,2,288928
12,2019-01-28,125,28,20,1330,1655,6659,0,4493,22324,20921,37350,2,291786
13,2019-02-28,11,29,20,1316,1747,6658,0,4542,23264,21796,39399,2,292988
14,2019-03-28,2,29,20,1322,1769,6537,0,4576,24390,22480,41390,2,295046
15,2019-04-28,2,30,23,1320,1782,6368,0,4747,25501,23455,42140,2,295844
16,2019-05-28,2,30,23,1315,1789,6129,0,4801,26529,24751,43261,2,296380

## COMBINATIONS

In [246]:
combinations_df = pd.read_csv(dir_path+'combinations.csv', index_col=0)
combinations_df.columns

Index(['producto_1', 'producto_2', 'total', 'total_1', 'total_2', 'prop_1'], dtype='object')

In [264]:
try:
    sSQL = "DROP TABLE combinaciones"
    cursor.execute(sSQL)
except: 
    pass

In [248]:
create_table(cursor, combinations_df, variables, "combinaciones")

CREATE TABLE combinaciones ( producto_1 VARCHAR(30), producto_2 VARCHAR(30), total INT, total_1 INT, total_2 INT, prop_1 FLOAT )

In [249]:
insert_into_db (cursor, combinations_df, variables, "combinaciones")
db.commit()

Acabado!

In [250]:
list_df = ['producto_1', 'producto_2', 'total', 'total_1', 'total_2', 'prop_1']

sSQL = "SELECT * FROM combinaciones"
cursor.execute(sSQL)
df = pd.DataFrame(cursor.fetchall(), columns=list_df)
df

,producto_1,producto_2,total,total_1,total_2,prop_1
0,short_term_deposit,em_acount,8626,15394,4381602,56.034800
1,short_term_deposit,debit_card,464,15394,562968,3.014160
2,short_term_deposit,long_term_deposit,365,15394,100660,2.371050
3,short_term_deposit,emc_account,353,15394,326961,2.293100
4,short_term_deposit,payroll_account,328,15394,329420,2.130700
...,...,...,...,...,...,...
74,em_account_p,payroll,5,34,205787,14.705900
75,em_account_p,pension_plan,5,34,217802,14.705900
76,em_acount,pension_plan,16562,4381602,217802,0.377990
77,em_acount,payroll,15958,4381602,205787,0.364205
78,payroll,pension_plan,205787,205787,217802,100.000000

## MAPA CLIENTES

In [284]:
mapa_df = pd.read_csv(dir_path+'mapa_clientes.csv', index_col=0)
mapa_df.columns = ['pais','region','lat','lon','count']
mapa_df.head()
#mapa_df.columns

        pais region      lat        lon  count
0    Algeria    NaN  28.0339   1.659600      1
1  Argentina    NaN -38.4161 -63.616700      3
2    Austria    NaN  47.5162  14.550100      3
3    Belgium    NaN  50.8333   4.469936      2
4     Brazil    NaN -14.2350 -51.925300      2

In [277]:
try:
    sSQL = "DROP TABLE mapa_clientes"
    cursor.execute(sSQL)
except: 
    pass

In [280]:
create_table(cursor, mapa_df, variables, "mapa_clientes")

CREATE TABLE mapa_clientes ( pais VARCHAR(30), region VARCHAR(30), lat FLOAT, lon FLOAT, count INT )

In [285]:
insert_into_db (cursor, mapa_df, variables, "mapa_clientes")
db.commit()

Acabado!

In [286]:
list_df = ['pais','region','lat','lon','count']

sSQL = "SELECT * FROM mapa_clientes"
cursor.execute(sSQL)
df = pd.DataFrame(cursor.fetchall(), columns=list_df)
df

              pais region      lat        lon  count
0          Algeria    nan  28.0339    1.65960      1
1        Argentina    nan -38.4161  -63.61670      3
2          Austria    nan  47.5162   14.55010      3
3          Belgium    nan  50.8333    4.46994      2
4           Brazil    nan -14.2350  -51.92530      2
..             ...    ...      ...        ...    ...
74           Spain  Ávila  40.6564   -4.70032    811
75     Switzerland    nan  46.8182    8.22750     11
76              US    nan  40.0000 -100.00000      8
77  United Kingdom    nan  55.3781   -3.43600     25
78       Venezuela    nan   6.4238  -66.58970      2

[79 rows x 5 columns]

## PERMANENCIAS

In [287]:
permanencias_df = pd.read_csv(dir_path+'permanencias.csv', index_col=0)
permanencias_df.head()

,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll_account,emc_account,debit_card,em_account_p,em_acount
1,222,0,0,50,123,185,0,3885,1530,1189,30931,0,7691
2,347,0,0,44,104,267,0,2323,824,698,8176,0,4293
3,2837,2,1,37,58,130,0,1005,621,527,4247,0,2967
4,22,1,0,30,24,124,0,586,492,358,2441,0,2350
5,1,0,0,24,30,160,0,436,2250,295,1939,0,2099

In [288]:
try:
    sSQL = "DROP TABLE permanencias"
    cursor.execute(sSQL)
except: 
    pass

In [289]:
create_table(cursor, permanencias_df, variables, "permanencias")

CREATE TABLE permanencias ( short_term_deposit INT, loans INT, mortgage INT, funds INT, securities INT, long_term_deposit INT, em_account_pp INT, credit_card INT, payroll_account INT, emc_account INT, debit_card INT, em_account_p INT, em_acount INT )

In [291]:
insert_into_db (cursor, permanencias_df, variables, "permanencias")
db.commit()

Acabado!

In [293]:
list_df = ['short_term_deposit','loans','mortgage','funds','securities',
 'long_term_deposit','em_account_pp','credit_card','payroll_account','emc_account','debit_card','em_account_p','em_acount']

sSQL = "SELECT * FROM permanencias"
cursor.execute(sSQL)
df = pd.DataFrame(cursor.fetchall(), columns=list_df)
df

,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll_account,emc_account,debit_card,em_account_p,em_acount
0,222,0,0,50,123,185,0,3885,1530,1189,30931,0,7691
1,347,0,0,44,104,267,0,2323,824,698,8176,0,4293
2,2837,2,1,37,58,130,0,1005,621,527,4247,0,2967
3,22,1,0,30,24,124,0,586,492,358,2441,0,2350
4,1,0,0,24,30,160,0,436,2250,295,1939,0,2099
5,7,1,0,39,17,245,0,306,399,291,1649,0,2256
6,0,2,0,20,15,222,0,246,430,255,1460,0,1945
7,0,2,0,15,11,255,0,179,370,232,797,0,1653
8,3,0,1,19,13,280,0,122,295,204,688,0,1495
9,0,0,0,22,8,289,0,108,266,181,646,0,1647
10,2,1,0,20,8,152,0,99,1254,184,450,0,1399
11,3,2,0,19,6,268,0,78,103,148,476,0,1070
12,1,0,0,25,8,531,0,57,123,132,449,0,1045
13,0,2,0,10,4,72,0,71,82,113,262,0,1001
14,0,1,0,7,5,60,0,46,65,79,259,0,870
15,0,0,0,4,7,66,0,43,63,86,197,0,929

## ANTIGÜEDADES

In [294]:
antiguedades_df = pd.read_csv(dir_path+'antiguedades.csv', index_col=0)
antiguedades_df.head()

,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll_account,emc_account,debit_card,em_account_p,em_acount
1,0,2,3,25,45,31,0,898,1627,1362,6782,0,3188
2,0,2,0,22,59,74,0,648,1441,978,3961,0,2784
3,0,1,0,21,92,194,0,394,1240,1124,3205,0,2116
4,0,1,1,32,224,169,0,268,1159,1004,1863,0,2026
5,0,1,0,44,64,393,0,201,1913,734,1937,0,3968

In [295]:
try:
    sSQL = "DROP TABLE antiguedades"
    cursor.execute(sSQL)
except: 
    pass

In [296]:
create_table(cursor, antiguedades_df, variables, "antiguedades")

CREATE TABLE antiguedades ( short_term_deposit INT, loans INT, mortgage INT, funds INT, securities INT, long_term_deposit INT, em_account_pp INT, credit_card INT, payroll_account INT, emc_account INT, debit_card INT, em_account_p INT, em_acount INT )

In [297]:
insert_into_db (cursor, antiguedades_df, variables, "antiguedades")
db.commit()

Acabado!

In [298]:
list_df = ['short_term_deposit','loans','mortgage','funds','securities',
 'long_term_deposit','em_account_pp','credit_card','payroll_account','emc_account','debit_card','em_account_p','em_acount']

sSQL = "SELECT * FROM antiguedades"
cursor.execute(sSQL)
df = pd.DataFrame(cursor.fetchall(), columns=list_df)
df

,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll_account,emc_account,debit_card,em_account_p,em_acount
0,0,2,3,25,45,31,0,898,1627,1362,6782,0,3188
1,0,2,0,22,59,74,0,648,1441,978,3961,0,2784
2,0,1,0,21,92,194,0,394,1240,1124,3205,0,2116
3,0,1,1,32,224,169,0,268,1159,1004,1863,0,2026
4,0,1,0,44,64,393,0,201,1913,734,1937,0,3968
5,0,0,0,45,32,304,0,212,1558,747,2128,0,2311
6,0,2,0,33,157,426,0,183,1109,445,2296,0,3109
7,0,1,0,30,51,427,0,166,784,454,1725,0,1831
8,0,2,0,53,82,297,0,146,1246,348,1140,0,3226
9,0,0,1,43,44,365,0,153,1258,404,953,0,561
10,0,0,1,47,21,313,0,129,736,506,919,0,1679
11,0,1,1,57,26,274,0,101,632,612,764,0,461
12,0,1,1,90,26,189,0,123,602,570,808,0,410
13,0,4,2,90,33,99,0,121,587,661,954,0,434
14,0,0,0,72,37,82,0,79,519,519,837,0,318
15,2,10,13,592,755,2155,0,1382,8754,13008,14144,2,193981

## CLIENTES PRIMERIZOS

In [303]:
first_buyers_df = pd.read_csv(dir_path+'first_buyers.csv')
first_buyers_df.head()
first_buyers_df.columns

Index(['pk_cid', 'pk_partition', 'entry_date', 'entry_channel',
       'active_customer', 'segment', 'short_term_deposit', 'loans', 'mortgage',
       'funds', 'securities', 'long_term_deposit', 'em_account_pp',
       'credit_card', 'payroll', 'pension_plan', 'payroll_account',
       'emc_account', 'debit_card', 'em_account_p', 'em_acount', 'buy',
       'total_ingresos', 'total_products'],
      dtype='object')

In [331]:
try:
    sSQL = "DROP TABLE clientes_primerizos"
    cursor.execute(sSQL)
except: 
    pass

In [308]:
create_table(cursor, first_buyers_df, variables, "clientes_primerizos")

CREATE TABLE clientes_primerizos ( pk_cid INT, pk_partition VARCHAR(11), entry_date VARCHAR(11), entry_channel VARCHAR(6), active_customer TINYINT, segment VARCHAR(20), short_term_deposit INT, loans INT, mortgage INT, funds INT, securities INT, long_term_deposit INT, em_account_pp INT, credit_card INT, payroll INT, pension_plan INT, payroll_account INT, emc_account INT, debit_card INT, em_account_p INT, em_acount INT, buy TINYINT, total_ingresos INT, total_products INT )

In [319]:
insert_into_db (cursor, first_buyers_df, variables, "clientes_primerizos")
db.commit()

KeyboardInterrupt:

In [330]:
list_df = ['short_term_deposit','loans','mortgage','funds','securities',
 'long_term_deposit','em_account_pp','credit_card','payroll_account','emc_account','debit_card','em_account_p','em_acount']

sSQL = "SELECT * FROM clientes_primerizos"
cursor.execute(sSQL)
cursor.fetchall()
#df = pd.DataFrame(cursor.fetchall(), columns=first_buyers_df.columns)
#df

()

In [ ]:
sociodemographic_df = pd.read_csv(dir_path+'sociodemographic_df.csv')
sociodemographic_df.drop('Unnamed: 0', axis=1, inplace=True)

In [ ]:
commercial_df = pd.read_csv(dir_path+'commercial_activity_df.csv')
commercial_df .drop('Unnamed: 0', axis=1, inplace=True)

In [14]:
products_df = pd.read_csv(dir_path+'products_df.csv')
products_df.drop('Unnamed: 0', axis=1, inplace=True)

In [15]:
products_df.columns

Index(['pk_cid', 'pk_partition', 'short_term_deposit', 'loans', 'mortgage',
       'funds', 'securities', 'long_term_deposit', 'em_account_pp',
       'credit_card', 'payroll', 'pension_plan', 'payroll_account',
       'emc_account', 'debit_card', 'em_account_p', 'em_acount'],
      dtype='object')

In [16]:
products_df.dtypes

pk_cid                  int64
pk_partition           object
short_term_deposit      int64
loans                   int64
mortgage                int64
funds                   int64
securities              int64
long_term_deposit       int64
em_account_pp           int64
credit_card             int64
payroll               float64
pension_plan          float64
payroll_account         int64
emc_account             int64
debit_card              int64
em_account_p            int64
em_acount               int64
dtype: object

In [26]:
from sys import getsizeof

boolean_cols = ["short_term_deposit", "loans", "mortgage", "funds", "securities", "long_term_deposit", "em_account_pp", "credit_card", "payroll_account", "emc_account", "debit_card", "em_account_p", "em_acount", "payroll", "pension_plan"] 

for x in boolean_cols:
    products_df[x] = products_df[x].astype(bool)

In [65]:
sSQL = ''' CREATE TABLE products (
    pk_cid INT,
    pk_partition VARCHAR(11),
    short_term_deposit TINYINT,
    loans TINYINT,
    mortgage TINYINT,
    funds TINYINT,
    securities TINYINT,
    long_term_deposit TINYINT,
    em_account_pp TINYINT,
    credit_card TINYINT,
    payroll TINYINT,
    pension_plan TINYINT,
    payroll_account TINYINT,
    emc_account TINYINT,
    debit_card TINYINT,
    em_account_p TINYINT,
    em_acount TINYINT
) '''
cursor.execute(sSQL)

0

In [66]:
sSQL = ''' SHOW TABLES '''
cursor.execute(sSQL)
cursor.fetchall()

(('person',), ('products',))

In [55]:
products_df.head()

,pk_cid,pk_partition,short_term_deposit,loans,mortgage,funds,securities,long_term_deposit,em_account_pp,credit_card,payroll,pension_plan,payroll_account,emc_account,debit_card,em_account_p,em_acount
0,1375586,2018-01-28,0,0,0,0,0,0,0,0,0.0,0.0,0,0,0,0,1
1,1050611,2018-01-28,0,0,0,0,0,0,0,0,0.0,0.0,0,0,0,0,1
2,1050612,2018-01-28,0,0,0,0,0,0,0,0,0.0,0.0,0,0,0,0,1
3,1050613,2018-01-28,1,0,0,0,0,0,0,0,0.0,0.0,0,0,0,0,0
4,1050614,2018-01-28,0,0,0,0,0,0,0,0,0.0,0.0,0,0,0,0,1

In [20]:
products_df.shape

(5962924, 17)

In [50]:
N = products_df.shape[0]
N

5962924

In [ ]:
5000/N*100

In [68]:
cont = 1
for key, row in products_df.iterrows():
    sSQL = ''' INSERT INTO products VALUES ( {}, '{}', 
        {}, {}, {}, {}, {}, 
        {}, {}, {}, {}, {}, 
        {}, {}, {}, {}, {} 
        )'''.format(row['pk_cid'], row['pk_partition'], row['short_term_deposit'], \
            row['loans'], row['mortgage'], row['funds'], row['securities'], row['long_term_deposit'], \
                row['em_account_pp'], row['credit_card'], int(row['payroll']), int(row['pension_plan']), row['payroll_account'], \
                    row['emc_account'], row['debit_card'], row['em_account_p'], row['em_acount'])
    cursor.execute(sSQL)

    if key/N*100 > cont:
        print(cont)
        cont += 1

db.commit()
print('Acabado')

In [67]:
sSQL = ''' SELECT * FROM products '''
cursor.execute(sSQL)
cursor.fetchall()

()

In [4]:
sSQL = ''' DROP TABLE products '''
cursor.execute(sSQL)

0